<template>
  <div class="privacyPolicy">
    <div class="userMain">
      <div class="cancelBtn" @click="cancelAction">×</div>
      <div class="agreeTitle">酷豆网通行证隐私政策</div>
      <div class="contentBox">
          <div>
              酷豆网通行证是一款由我们提供服务的会员账户平台，在您使用酷豆网通行证的各项服务时，酷豆网通行证会如何收集、使用和存储您的个人信息，以及您享有何种权利、如何与我们沟通联系，我们将通过本政策向您阐述相关事宜。<br>
              本政策仅适用于深圳市汇米易通网络科技有限公司的酷豆网通行证产品或服务。如我们关联公司的产品或者服务中使用了酷豆网通行证提供的产品或服务但未设独立的隐私政策，则本政策同样适用于该部分产品或服务。<br>
              《酷豆网隐私政策》是酷豆网统一适用的一般性隐私条款，其中所规定的用户权利及信息安全保障措施均适用于酷豆网通行证用户。如《酷豆网隐私政策》与本政策存在不一致或矛盾之处，请以本政策为准。<br>
              如果您有任何疑问、意见或建议，请通过以下联系方式与我们联系：<br>
              电子邮件：3001188720@qq.com<br>
              电    话：0755-23023748<br>
              本政策将帮助您了解以下内容：<br>
              1.我们如何收集和使用您的个人信息<br>
              2.我们如何使用 Cookie和同类技术<br>
              3.我们如何共享、转让、公开披露您的个人信息<br>
              4.我们如何保护您的个人信息<br>
              5.您的权利<br>
              6.我们如何处理未成年人的个人信息<br>
              7.您的个人信息如何在全球范围转移<br>
              8.本政策如何更新<br>
              9.如何联系我们<br>
              酷豆网通行证深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时,酷豆网通行证承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。<br>
              请在使用我们的产品或服务前，仔细阅读并了解本《隐私政策》，在确认充分理解并同意后再使用相关产品或服务。一旦您点击同意、确认或者开始使用酷豆网通行证产品或者服务，即表示您已充分理解并同意本政策。<br>
              1. 我们如何收集和使用您的个人信息<br>
              个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。<br>
              酷豆网通行证仅会出于本政策所述的以下目的，收集和使用您的个人信息：<br>
              1.1当您注册酷豆网通行证时：如果您是个人用户，我们会根据您填写的资料，收集您的手机号、创建的用户名、密码和IP信息；如果您是企业用户，我们会根据您填写的资料，收集您的手机号、创建的用户名、密码、企业名称、企业联系人信息和IP。收集这些信息是为了帮助您完成酷豆网通行证的注册，完成身份验证，保护您账号的安全并及时与您取得联系。若您不提供上述信息，您可能无法正常使用我们的产品或服务。<br>
              1.2如您通过酷豆网通行证的关联产品（例如：酷豆网游戏大厅）注册酷豆网通行证时，注册及登录过程中可能会额外要求您提供以下信息：真实姓名、公民身份号码。这是为了满足法律法规对于实名制上网、网游防沉迷系统标准的要求。若您不提供这类信息，您可能无法正常使用我们的服务。您提供的上述信息，将在您使用酷豆网通行证产品或者服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息。<br>
              1.3当您注册酷豆网通行证或使用酷豆网通行证登录时，为保证账户安全和行为真实有效，我们会对您的注册或登录行为进行验证，该功能由深圳市汇米易通网络科技有限公司为您提供服务。其在验证时，可能会收集您的设备信息、日志信息，具体隐私政策详见《极验用户隐私声明》。单独的设备信息、日志信息是无法识别特定自然人身份的信息。除非将这些非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用。<br>
              1.4当您登录酷豆网通行证账号后，我们会收集您的登录IP信息、修改手机/电子邮箱/密保问题/登录密码的操作记录。收集这些信息是为了确保您账号的安全。如果您不提供上述信息，将无法确保账户安全。如果您提供以下信息：昵称、性别、QQ号、联系地址、邮编、电子邮箱、账号安全口令、开通安全服务，将有助于我们给您提供更好的服务和体验，方便我们与您进行沟通，提高账户安全性。如果您不提供这些信息，将不会影响使用本产品或服务的基本业务功能。<br>
              1.5当您使用QQ、微信、新浪微博账号登录酷豆网通行证时，该功能由QQ、微信、新浪微博提供验证等服务，其可能会搜集相应的信息。收集上述信息，仅是为了提供便捷登录服务。请您在登录前，阅读《酷豆网通行证隐私政策》和QQ、微信、新浪微博相应的隐私政策或指引。您可以拒绝提供这些信息。如果您不提供这些信息，将无法获得便捷登录服务，但不会影响使用本产品或服务的基本业务功能。<br>
              1.6当您在使用酷豆网通行证的实名认证功能时，我们会根据您填写的信息，收集您的相关信息：当您是个人用户时，我们会收集您的姓名、公民身份号码、身份证照片信息；当您是企业用户时，我们会收集您的公司名称、法人、法人联系方式、公司地址、公司开票信息、公司营业执照及相关资质证明、公司授权人的身份证、照片信息；当您是网吧用户时，我们会收集您网吧的名称、网吧经营人姓名及身份证、网吧资质证明文件、网吧经营照片信息。收集这些信息是为了进行实名认证，确保账户安全，同时保证您的账户资金安全。如果您不提供这些信息，我们将无法核验您的身份情况，但不影响您正常使用酷豆网通行证的其他功能。<br>
              1.7当您参与酷豆网及其关联公司的业务时，您的酷豆网通行证账号可能产生积分和收入，如果您需要进行提现等结算时，我们会根据1.6条收集您的身份信息并进行验证。如果您不提供这些信息，我们将无法核验您的身份情况，无法和您进行收入结算，但不影响您正常使用酷豆网通行证的其他功能。<br>
              1.8当您遗忘了您的账号信息时（如：绑定手机，账号密码），如您提供以下信息：常用密码、账号注册地区、账号常用地区、真实姓名、公民身份号码、手机或邮箱，将有助于酷豆网通行证与此前您提供的IP地址、手机号等进行比对，识别您的信息是否真实匹配，从而帮助您找回账号信息。如果您提供以下额外信息：实名认证信息、注册时间、参与酷豆网及其关联公司业务（如酷豆网游戏）的支付证明，将有助于我们更好地识别，更快地帮您找回账号和密码信息。<br>
              另外，根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：<br>
              1) 与本公司履行法律法规规定的义务相关的；<br>
              2) 与国家安全、国防安全直接相关的；<br>
              3) 与公共安全、公共卫生、重大公共利益直接相关的；<br>
              4) 与犯罪侦查、起诉、审判和判决执行等直接相关的；<br>
              5) 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br>
              6) 所涉及的个人信息是您自行向社会公众公开的；<br>
              7) 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；<br>
              8) 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；<br>
              9) 为新闻单位且其在开展合法的新闻报道所必需的；<br>
              10) 为学术研究机构，出于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。<br>
              需要特别说明的是：<br>
              1）我们向您提供的产品和服务是不断更新发展的。如果因业务需要，确需超出上述范围收集、使用个人信息，我们会通过弹窗、页面提示、网站公告等方式，向您说明信息收集和使用的具体情况，并征得您的同意。<br>
              2）目前，酷豆网通行证不会主动从酷豆网及其关联公司外的第三方获取您的个人信息。若将来为了业务发展的需要，酷豆网通行证从第三方间接获取了您个人信息，我们会在获取前，告知您个人信息的来源、类型及使用范围，并征得您的明示同意。<br>
              3）对所收集的个人信息进行加工处理而产生的信息，能够单独或与其他信息结合识别您个人身份，或者反映您个人活动情况的，我们对其处理遵循收集个人信息时获得的授权同意范围。<br>
              2. 我们如何使用 Cookie 和同类技术<br>
              2.1 Cookie<br>
              为确保网站正常运转，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的ID和token等数据，这是用来验证您登录的有效性。<br>
              我们不会将Cookie用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。有关详情，请参见AboutCookies.org。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。如需详细了解如何更改浏览器设置，请访问以下链接： internet Explorer 、google Chrome 、mozilla Firefox、safari 和 opera 。<br>
              2.2网站信标和像素标签<br>
              除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击 URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。<br>
              2.3Do Not Track（请勿追踪）<br>
              很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。<br>
              3. 我们如何共享、转让、公开披露您的个人信息<br>
              3.1共享<br>
              我们不会与酷豆网及其关联公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：<br>
              （1）在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。<br>
              （2）我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。<br>
              （3）与我们的关联公司共享：您的个人信息可能会与酷豆网的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。<br>
              （4）与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。<br>
              3.2转让<br>
              我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：<br>
              （1）在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；<br>
              （2）在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。<br>
              3.3公开披露<br>
              我们仅会在以下情况下，公开披露您的个人信息：<br>
              （1）获得您明确同意后；<br>
              （2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。<br>
              4.我们如何保护您的个人信息<br>
              4.1我们已使用符合业界标准的安全防护措施保护您提供的个人信息， 防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据时受 SSL 加密保护；我们同时对网站提供 https 等安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。<br>
              4.2我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。<br>
              4.3互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。<br>
              4.4我们将定期更新并公开安全风险、个人信息安全影响评估等报告的有关内容。您可通过酷豆网通行证平台等方式获得。<br>
              4.5互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。<br>
              4.6在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。<br>
              同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br>
              5. 您的权利<br>
              按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：<br>
              5.1访问您的个人信息<br>
              您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：<br>
              账户信息——如果您希望访问或编辑您的账户中的个人资料信息、更改您的密码、添加安全信息或关闭您的账户等，您可以通过访问酷豆网通行证平台或与我们联系的方式执行此类操作。<br>
              5.2更正您的个人信息<br>
              当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过“5.1访问您的个人信息”中罗列的方式提出更正申请。<br>
              如果您无法通过上述方法更正这些个人信息，您可以随时通过本政策开头部分的邮箱、电话、传真与我们取得联系。我们将在30天内回复您的更正请求。<br>
              5.2.1更改昵称、性别、QQ、邮编、联系地址：<br>
              1)进入酷豆网通行证平台后，点击“修改资料”；<br>
              2)更改昵称、性别、QQ、邮编、联系地址。<br>
              5.2.2更改头像：<br>
              1)进入酷豆网通行证平台后，点击“修改资料”；<br>
              2)点击“修改头像”<br>
              3)更改头像。<br>
              5.2.3更改手机、电子邮箱、密保问题<br>
              1) 进入酷豆网通行证平台后，在首页选择手机绑定/邮箱绑定/密保问题设置；<br>
              2) 点击“修改”；<br>
              3) 更改手机、电子邮箱、密保问题。<br>
              5.2.4更改密码<br>
              1) 进入酷豆网通行证平台后，点击“密码管理”；<br>
              2) 更改密码。<br>
              5.3删除您的个人信息<br>
              在以下情形中，您可以向我们提出删除个人信息的请求：<br>
              （1）如果我们处理个人信息的行为违反法律法规；<br>
              （2）如果我们收集、使用您的个人信息，却未征得您的同意；<br>
              （3）如果我们处理个人信息的行为违反了与您的约定；<br>
              （4）如果您不再使用我们的产品或服务，或您注销了账号；<br>
              （5）如果我们不再为您提供产品或服务。<br>
              若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。<br>
              当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br>
              5.4改变您授权同意的范围<br>
              每个业务功能需要一些基本的个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。<br>
              5.5个人信息主体注销账户<br>
              您随时可注销此前注册的账户，您可以通过以下方式操作：<br>
              1) 进入酷豆网通行证平台后，点击“修改资料”；<br>
              2) 点击“账号注销服务”；<br>
              3) 根据指示进行操作。<br>
              在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除或者匿名化处理您的个人信息，法律法规另有规定的除外。<br>
              5.6约束信息系统自动决策<br>
              在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。<br>
              5.7响应您的上述请求<br>
              为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。原则上，我们将在三十天内做出答复。<br>
              对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份存放的信息）的请求，我们可能会予以拒绝。<br>
              在以下情形中，我们将无法响应您的请求：<br>
              （1）与个人信息控制者履行法律法规规定的义务相关的；<br>
              （2）与国家安全、国防安全直接相关的；<br>
              （3）与公共安全、公共卫生、重大公共利益直接相关的；<br>
              （4）与犯罪侦查、起诉、审判和执行判决等直接相关的；<br>
              （5）个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的；<br>
              （6）出于维护个人信息主体或其他个人的生命、财产等重大合法权益 但又很难得到本人同意的；<br>
              （7）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br>
              （8）涉及商业秘密的。<br>
              6.我们如何处理未成年人的个人信息<br>
              我们的产品和服务主要面向成人。如果没有父母或监护人的同意，未成年人不得创建自己的用户账户。对于经父母同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。<br>
              我们将不满18周岁的任何人都视为未成年人。<br>
              如果我们发现自己在未事先获得法律允许、可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。<br>
              7. 您的个人信息如何在全球范围转移<br>
              原则上，我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。<br>
              由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，在获得您的授权同意后，您的个人信息可能会被转移到您使用产品或服务所在国家/地区的境外管辖区，或者受到来自这些管辖区的访问。<br>
              此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。<br>
              8. 本政策如何更新<br>
              我们的隐私政策可能变更。但未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。<br>
              我们会在您登录或者使用时以推送通知、弹窗等形式向您展示变更后的政策。对于重大变更，我们还会提供更为显著的通知。本政策所指的重大变更包括但不限于：（1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等。（2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等。（3）个人信息共享、转让或公开披露的主要对象发生变化。（4）您参与个人信息处理方面的权利及其行使方式发生重大变化。（5）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。（6）个人信息安全影响评估报告表明存在高风险时。<br>
              9. 如何联系我们<br>
              如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：<br>
              您可以将你的问题发送至 3001188720@qq.com：<br>
              我们将尽快审核所涉问题，一般情况下，我们会在验证您的用户身份后的三十天内回复。<br>
              如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过以下外部途径寻求解决方案：向您所在国家的监管部门进行投诉或举报，例如中国的网信、电信、公安及市场监管等部门。<br>
              深圳市汇米易通网络科技有限公司<br>
          </div>
      </div>
    </div>
    <div class="bgColor" @click="cancelAction"></div>
  </div>
</template>

<script>
  export default {
    data(){
      return{

      }
    },
    methods:{
      cancelAction(){
        this.$emit('ShowPrivacyFlase',false);
      }
    }

  }
</script>

<style lang="scss" scoped>
  .privacyPolicy{
    position: fixed;
    left: 0;
    top: 0;
    bottom: 0;
    right: 0;
    width: 100%;
    overflow: hidden;
    z-index: 2000;
    .bgColor{
      display: flex;
      width: 100%;
      height: 100%;
      background: rgba(0,0,0,0.5);
    }
    .userMain{
      position: absolute;
      left: 50%;
      top: 50%;
      -webkit-transform:translate(-50%, -50%);
      -moz-transform:translate(-50%, -50%);
      transform:translate( -50%, -50%);
      z-index: 20001;
      background: #fff;
      border-radius: 10px;
      width: 400px;
      padding-bottom: 10px;
      .cancelBtn{
        position: absolute;
        right: 0;
        top: 0;
        width: 26px;
        height: 26px;
        line-height: 26px;
        text-align: center;
        font-size: 20px;
        cursor: pointer;
        &:hover{
          color: #FEA503;
        }
      }
      .agreeTitle{
        height: 60px;
        line-height: 60px;
        font-size:24px ;
        text-align: center;
        border-bottom: 1px solid #EFEFEF;
      }
      .contentBox{
        padding: 0 10px;
        height: 370px;
        overflow-y: auto;
        color: #666;
        font-size: 14px;
        p{
          height: 30px;
          line-height: 30px;
          margin-bottom: 20px;
        }
        >div{
          line-height: 26px;
          text-align: justify;
        }
      }
      .contentBox::-webkit-scrollbar {
        /*滚动条整体样式*/
        width: 4px;
        height: 1px;
      }
      .contentBox::-webkit-scrollbar-thumb {
        /*滚动条里面小方块*/
        border-radius:4px;
        -webkit-box-shadow: inset 0 0 5px rgba(0,0,0,0.2);
        background: #666;
      }
      .contentBox::-webkit-scrollbar-track {
        /*滚动条里面轨道*/
        -webkit-box-shadow: inset 0 0 4px rgba(0,0,0,0.2);
        border-radius: 4px;
        background: #EDEDED;
      }
    }

  }

</style>
